{"Visa": "I applied for a visa invitation a few days/weeks ago and still haven't received it. What should I do in this situation?\nThere is nothing to worry about. The invitation is issued by the Ministry of Foreign Affairs of the Russian Federation and takes at least 30 days to be prepared. If you do not receive your invitation 40 days after submitting the application, please contact the Admissions Office at admission@urfu.ru.\n\nHow do I extend my visa?\nPlease visit the GUK-109 office at least six weeks prior to the expiration date of your current visa. You will be consulted on the visa extension procedures.", "Accommodation": "Does UrFU provide accommodation for international students?\nAll international students of UrFU receive a place in one of the campus dormitories. The approximate accommodation fee is 1800 rubles per month. You can find more info here.\n\nHow many people are there in a dormitory room?\nThere are usually two or three people living in one dormitory room.\n\nWill my dormitory room be ready when I arrive?\nEvery student has the right to get a room in an university dormitory if places are available or free. However, please keep in mind that, according to the legislation, every student must undergo a standard medical examination before they are allowed to check into a university dormitory room. Since the medical examination may take up more than one day, you might need to book a hotel room for this time. Should you need any help with booking, please contact our Buddy System coordinators.\n\nContacts:\n\nadaptatiom.urfu.ru, https://vk.com/adaptationurfu\n\nWhat is the address of my dormitory?\nThe address of your dormitory will be written in the voucher for the dormitory, which you will receive in the International Students Adaptation Center. You can find its address here.\n\nWhat do I need to do before I check in?\nAccording to the legislation, all students must undergo a standard medical examination before checking into a dormitory room. You will receive all required information in the Admissions Office (19 Mira Street, office GUK-109).\n\nPlease have the following documents with you:\n\nRecent photofluorography\nVaccination certificate/other vaccination info\nDescription of your general state of health from your physician\nOther medical certificates that might be necessary\nAre there any other accommodation options?\nIf you prefer renting a flat to living in a dormitory, our Student Union can help you find a suitable paid accommodation and – if necessary – a flatmate.\n\nContacts:\n\n+7 (343) 375-45-18", "Studies": "How does the Russian higher education system work?\nThe Russian education system is a multistage process that encourages lifelong learning. This system includes compulsory general education (kindergartens and schools) and professional education (colleges, technical schools, universities). In turn, professional education is divided into secondary and higher education. Professional development and retraining programs are considered the final educational stage.\n\nBachelor's and Specialist's degrees\n\nRussia has adopted the Bologna Process, which is a three-cycle educational system consisting of an undergraduate degree (4 years) and a Master's degree (2 years) During their Bachelor's degree, students gain a broad understanding of their chosen specialty, with the opportunity to explore various areas of interest. Graduates with a Bachelor's degree can immediately begin working in their chosen profession, or they can continue their studies at the next level. Additionally, some universities still offer specialist programs, a level that only exists in Russia. Specialist programs provide a more focused education over 5–6 years that emphasizes practical skills.\n\nMaster's degree\n\nThe Master's Degree is the second stage of higher education in the Bologna Process. To be admitted into a Master's program, applicants must have a Bachelor's or Specialist's degree. These programs are generally more research-oriented, providing students with an in-depth understanding of their chosen subject. Master's programs usually last two years and focus mainly on the Student's ability to independently grasp the material.\n\nPostgraduate program\n\nPostgraduate programs are mainly for training research and teaching personnel. To be admitted into a postgraduate program, applicants must have a Master's or Specialist's Degree. These programs include educational aspects, pedagogical and practical work, and research. Graduate students must choose a scientific area and research topic for their dissertation. In-person, full-time programs are at least 3 years, while part-time programs are at least 4. At the end of the program, successful candidates receive a postgraduate diploma with a qualification (\"Researcher\", \"Research Teacher\"). After defending their dissertation, graduate students are awarded a Candidate of Science degree, which is the first of two doctoral-level scientific degrees. Candidates of Sciences are then eligible for the Doctor of Sciences degree (the second doctoral-level scientific degree), which is awarded following the defense of a doctoral dissertation.\n\n For more information, visit the Education in Russia web page.\n\nWhat is the Point-Grade System (БРС)?\nThe Point-Grade System is a digital mark for evaluating students' learning activities and achievements. The Point-Grade System is a system for determining the level of student success based on the cumulative principle of assessing academic performance and its results.\n\nWhen do lectures begin and finish?\nAll the information about dates can be found here."}